Revit 2024 API
StructuralElementDefinitionData.IsMirrored Property
 States if the structural section of the element is mirrored.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool IsMirrored { get; }
Visual Basic
Public ReadOnly Property IsMirrored As Boolean
	Get
Visual C++
public:
property bool IsMirrored {
	bool get ();
}
See Also
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace